data/perf/campaign-f3deebfbab60/primary/memcached/tsan-st/run3/memtier.txt
10        Threads
50        Connections per thread
100000    Requests per client


BEST RUN RESULTS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       157321.70          ---          ---         4.92140         4.86300        11.39100        14.27100     10737.16 
Gets      1573199.71      1263.28   1571936.43         4.81060         4.73500        11.19900        14.14300     39848.20 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1730521.41      1263.28   1571936.43         4.82068         4.73500        11.19900        14.14300     50585.35 


WORST RUN RESULTS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       150900.72          ---          ---         5.02225         4.99100        11.45500        14.39900     10298.93 
Gets      1508990.55      1211.72   1507778.83         4.90766         4.86300        11.26300        14.20700     38221.82 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1659891.27      1211.72   1507778.83         4.91808         4.86300        11.26300        14.20700     48520.75 


AGGREGATED AVERAGE RESULTS (5 runs)
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       153175.32          ---          ---         4.95990         4.89500        11.39100        14.33500     10454.17 
Gets      1531736.37      1118.64   1530617.73         4.84731         4.76700        11.19900        14.14300     38791.23 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1684911.70      1118.64   1530617.73         4.85755         4.79900        11.19900        14.14300     49245.40